package edu.adm.spbstu.whattowear;

import java.util.HashMap;
import java.util.TreeMap;

public class CityCoordinate {

    static final TreeMap<String, String> map = new TreeMap<>();
    static {
        map.put("Санкт-Петербург", "59.976665,30.320833");
        map.put("Москва", "55.751244,37.618423");
        map.put("Калининград", "54.715424,20.509207");
        map.put("Владивосток", "43.10562,131.87353");
        map.put("Волгоград", "48.700001,44.516666");
        map.put("Самара", "53.241505,50.221245");
        map.put("Санкт-Петербург2", "59.976665,30.320833");
        map.put("Москва2", "55.751244,37.618423");
        map.put("Калининград2", "54.715424,20.509207");
        map.put("Владивосток2", "43.10562,131.87353");
        map.put("Волгоград2", "48.700001,44.516666");
        map.put("Самара2", "53.241505,50.221245");
        map.put("Санкт-Петербург3", "59.976665,30.320833");
        map.put("Москва3", "55.751244,37.618423");
        map.put("Калининград3", "54.715424,20.509207");
        map.put("Владивосток3", "43.10562,131.87353");
        map.put("Волгоград3", "48.700001,44.516666");
        map.put("Самара3", "53.241505,50.221245");
    }
}
