package edu.adm.spbstu.whattowear;

import java.util.TreeMap;

public class CityCoordinate {

    static final TreeMap<String, String> map = new TreeMap<>();
    static {
        map.put("Санкт-Петербург", "59.976665,30.320833");
        map.put("Москва", "55.751244,37.618423");
        map.put("Калининград", "54.715424,20.509207");
        map.put("Владивосток", "43.10562,131.87353");
        map.put("Волгоград", "48.700001,44.516666");
        map.put("Самара", "53.241505,50.221245");
        map.put("Мурманск", "68.969563,33.074540");
        map.put("Архангельск", "64.555193,40.630101");
        map.put("Белгород", "50.593680,36.584136");
        map.put("Воронеж", "51.656106,39.206133");
        map.put("Иваново", "56.999493,40.977977");
        map.put("Иркутск", "52.292256,104.293919");
        map.put("Петропавловск-Камчатский", "53.026077,158.647087");
        map.put("Краснодар", "45.047590,38.984455");
        map.put("Магадан", "59.565070,150.821720");
        map.put("Новосибирск", "55.023783,82.925027");
        map.put("Оренбург", "51.774631,55.104433");
        map.put("Пермь", "58.019807,56.261747");
        map.put("Кисловодск", "43.908099,42.724726");
        map.put("Хабаровск", "48.505690,135.078489");
        map.put("Челябинск", "55.173328,61.414222");
    }
}
